In [1]:
import pandas as pd
data = {'id':[1,2,3,4],
        'Name': ['Johny', 'Mary', 'Peter', 'David'],
        'Salary': [70000, 80000, 60000, 90000],
        'managerid':[3, 4, None, None]
        }
df = pd.DataFrame(data) 
df.count() # returns no of elements in each column
df

   id   Name  Salary  managerid
0   1  Johny   70000        3.0
1   2   Mary   80000        4.0
2   3  Peter   60000        NaN
3   4  David   90000        NaN

In [5]:
df = df.rename(columns={'Name':'Employee'}) # Change column name
df

   id Employee  Salary  managerid
0   1     John   70000        3.0
1   2     Mary   80000        4.0
2   3    Peter   60000        NaN
3   4    David   90000        NaN

In [6]:
# Get value at a certain index and get that index from another column
print(df['managerid'].map(df.set_index('id')['Salary']))

0    60000.0
1    90000.0
2        NaN
3        NaN
Name: managerid, dtype: float64

# Map 

## Have Three Types

1. Function Based Mapping
2. Dictionary Based Mapping
3. Series Based Mapping

In [3]:
# it is used to pass a value to a function several times and to get value inside a dataframe (Function Based)
def celcius_to_fahrenheit(celcius):
    return (celcius * 9/5) + 32

celcius_df = pd.DataFrame({"temperature_celcius":[0, 25, -10, 100, 37.5]})
celcius_df.insert(1, "celcius_fahrenheit", celcius_df['temperature_celcius'].map(celcius_to_fahrenheit))
celcius_df

   temperature_celcius  celcius_fahrenheit
0                  0.0                32.0
1                 25.0                77.0
2                -10.0                14.0
3                100.0               212.0
4                 37.5                99.5

In [5]:
# You can use dictionaries to map values from one set to another. This is particularly useful when you want to replace or recode values in a column. (Dictionary Based)

# consider a DataFrame with a 'gender' column containing 'M' and 'F' values, and you want to replace them with 'Male' and 'Female':
Gender_df = pd.DataFrame({"gender":['M', 'F', 'F', 'M']})
gender_mapping = {'M':'Male', 'F':'Female'} # Store the value you want to replace as key and the value you want in value position
Gender_df['gender'] = Gender_df['gender'].map(gender_mapping)
Gender_df

   gender
0    Male
1  Female
2  Female
3    Male

In [9]:
# Series Based - Sometimes, you may need to map values using another Series or DataFrame.
# Pandas aligns the data based on the index, making it a powerful tool for mapping values between related datasets.

# Let's say you have a DataFrame with student names and their corresponding grades, 
# and you want to map the grades to another DataFrame with grade scales:

student_grade = pd.DataFrame({"Students Name":["rahul", "sohan", "mohan", "roshani"], "grade":["A", "B", "A", "D"]})
grade_scales = pd.Series({'A':"Excellent", 'B':"Very Good", "C":"Good", "D":"Exceptional"})
student_grade['grade'] = student_grade.insert(2, "Grade Scales", student_grade["grade"].map(grade_scales))
student_grade['Students Name'][0][0]

'r'

# Duplicated

In [10]:
dup = student_grade.duplicated(subset=['Grade Scales'], keep='first') # it will only look in the grade scales column and it will set the first occurence to false and rest will be true and it returns a series with bool values
student_grade = student_grade.drop_duplicates(subset='Grade Scales', keep='first')
student_grade

  Students Name grade Grade Scales
0         rahul  None    Excellent
1         sohan  None    Very Good
3         rohan  None  Exceptional

In [16]:
# To search for a duplicate value in a column
dup_value = student_grade.loc[student_grade.duplicated(subset=['Grade Scales']), ['Grade Scales']] # here we are looking for the duplicated values in a column by 
# using loc function which gets the location of the dup element using dublicated method which returns a series of bool values and 
dup_value.s

  Grade Scales
2    Excellent

# Assign

In [6]:
# it adds a new column at the end
df = df.assign(new_salary = lambda x : df['Salary'] * 2)
df

   id   Name  Salary  managerid  new_salary
0   1   John   70000        3.0      140000
1   2   Mary   80000        4.0      160000
2   3  Peter   60000        NaN      120000
3   4  David   90000        NaN      180000

# Get String length in a column

In [16]:
length_of_each_string = student_grade['Students Name'].str.len()
length_of_each_string

0    5
1    5
2    5
3    7
Name: Students Name, dtype: int64

# Loc

In [ ]:
# It is used to get a column from a df

# Min and Max

In [6]:
celcius_df['celcius_fahrenheit'].max()
celcius_df['celcius_fahrenheit'].min()

14.0

# Sorting

In [21]:
df.set_index(pd.Index([5, 4, 3, 2]), inplace=True)
df.sort_index(inplace=True, kind='mergesort')
df

# if index is in alpha format
df.set_index(pd.Index(["A", "D", 'C', 'E']), inplace=True)
df.sort_index(key=lambda x: x.str.lower(), inplace=True)
df

   id   Name  Salary  managerid
A   1  Johny   70000        3.0
C   2   Mary   80000        4.0
D   3  Peter   60000        NaN
E   4  David   90000        NaN

In [23]:
# Sort Using Values
df.sort_values(inplace=True, by=['Salary']) # It will be sorted according to the salary column
df.sort_values(inplace=True, by=['Name']) # It will be sorted according to the Name column

df

   id   Name  Salary  managerid
E   4  David   90000        NaN
A   1  Johny   70000        3.0
C   2   Mary   80000        4.0
D   3  Peter   60000        NaN

# Ranking

In [24]:
df.rank() # it gives the rank to each value of each column

    id  Name  Salary  managerid
E  4.0   1.0     4.0        NaN
A  1.0   2.0     2.0        1.0
C  2.0   3.0     3.0        2.0
D  3.0   4.0     1.0        NaN

# Query

In [3]:
df.query('Salary > 65000') # query takes a argument as string and return the positive result

   id   Name  Salary  managerid
0   1  Johny   70000        3.0
1   2   Mary   80000        4.0
3   4  David   90000        NaN

# Count no. of occurence in a column

In [5]:
df = df.groupby(['Salary']).count().reset_index()
df[df['id'] > 0][['Salary']]

   Salary
0   60000
1   70000
2   80000
3   90000